Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/election_of_university_candidates_to_the_seanad.html.txt.tmx
Source language: en
Languages: ga

source: Seanad - election of university candidates
ga: Seanad - toghchán iarrthóirí ollscoile

source: The Constitution states that 6 members of the Seanad may be elected by the universities of Ireland
ga: Is féidir, de réir an Bhunreachta, le Ollscoileanna na hÉireann seisear a thoghadh chuig an Seanad

source: The University Constituency consists of graduates of the National University of Ireland and the University of Dublin
ga: Is iad céimithe Ollscoil na hÉireann agus Ollscoil Bhaile Átha Cliath iad toghcheantar na hollscoile

source: To put yourself forward as a candidate for the Seanad, you must be nominated by 2 registered electors for a university
ga: Ní mór go mbeadh duine ainmnithe ag beirt vótálaithe cláraithe ollscoile mar iarrthóir don Seanad

source: Eight other registered electors for the university concerned must assent to the nomination
ga: Ní mór go n-aontóidh ochtar eile vótálaithe don ollscoil chuí leis an ainmniúchán

source: You do not have to be a graduate of the university concerned or be connected to it in any way
ga: Ní gá gur céimí de chuid na hollscoile cuí thú ná go mbeadh aon cheangal agat leis an ollscoil sin

source: However, you must be eligible to become a Senator
ga: Ach, ní mór duit a bheith intofa mar Sheanadóir

source: Voting in the university elections for the Seanad is done by post
ga: Vótáil phoist atá i gceist le toghcháin na nOllscoileanna don Seanad

source: The returning officer sends a ballot paper and a "declaration of identity" form to every person eligible to vote
ga: Cuireann an Ceann Comhaireamh páipéar ballóide agus "foirm dhearbhú aitheantais" chuig gach duine a bhfuil vóta aige/aici

source: The voter completes the declaration of identity form in the presence of a witness
ga: Comhlíonann an vótálaí an fhoirm dhearbhú aitheantais i láthair finné

source: They then complete the ballot paper by marking their order of preference of candidates
ga: Ansin, comhlíonann sé/sí an páipéar ballóide le vóta a thabhairt de réir a rogha do na hiarrthóirí

source: Both the declaration of identity and the ballot paper are sent back to the returning officer
ga: Cuirtear an dearbhú aitheantais agus an páipéar ballóide ar ais chuig an gCeann Comhaireamh

source: The votes are counted and the system of proportional representation with single transferable vote applies
ga: Déantar na vótaí a chomhaireamh de réir na hionadaíochta cionúire ar mhodh an aonghutha inaistrithe

source: If a casual vacancy arises it will be filled by a by-election
ga: Má thagann folúntas aníos ó am go chéile tionólfar fo-thoghchán len é a líonadh

source: The procedure is the same as in an ordinary election except that only one candidate is elected instead of 6
ga: Tá an córas vótála mar an gcéanna le gnáth thoghchán ach go ndéantar iarrthóir amháin a thogh in áit seisear

source: To vote in an election of university members to the Seanad, you must:
ga: Le vóta a chaitheamh i dtoghchán baill ollscoile chuig an Seanad, ní mór duit:

source: • Be an Irish citizen
ga: • A bheith i do shaoránach Éireannach

source: • Be over 18 years old
ga: • A bheith ós cionn 18

source: • Have received a degree (not an honorary degree) from one of the Universities of Ireland
ga: • Céim a bheith bainte amach agat (ní leor céim oinigh) ó cheann de Ollscoileanna na hÉireann

source: • Be registered as an elector
ga: • A bheith cláraithe mar vótálaí

source: If you are a graduate of an NUI constituent university or recognised college (pdf), you will be issued with a registration claim form at the time of conferring, however, you can request a registration form (pdf) at any time
ga: Más céimí de chuid Ollscoil na hÉireann (OÉ) thú chomh ollscoil nó coláiste aitheanta (pdf), tabharfar foirm éilimh ar chlárú duit nuair a bhronnfar ort do chéim, ach, is féidir foirm chláraithe (pdf) a éileamh ag am ar bith

source: If you are a graduate of the University of Dublin (Trinity College) you will be issued with a registration claim form at the time of conferring, however, you can request a registration form (pdf) at any time
ga: Más céimí thú d' Ollscoil Bhaile Átha Cliath (Coláiste na Tríonóide), tabharfar foirm éilimh ar chlárú duit nuair a bhronnfar ort do chéim, ach, is féidir foirm chláraithe (pdf) a éileamh ag am ar bith

source: Graduates of NUI and the University of Dublin must return completed registration claim forms by 26 February to be listed in their respective Seanad Éireann registers, which are published on 1 June
ga: Ní mór do chéimithe OÉ agus Ollscoil Bhaile Átha Cliath foirmeacha éilimh ar chlárú comhlíonta a chur ar ais faoin 26 Feabhra le bheith san áireamh ar chlár Sheanad Éireann, a fhoilsítear gach bliain ar 1 Meitheamh

source: If you are registered as an elector with the university, you will receive a declaration of identity form and a ballot paper in the post
ga: Má tá tú cláraithe mar vótálaí leis an Ollscoil, gheobhaidh tú foirm dhearbhú aitheantais agus páipéar ballóide sa phost

source: You must complete the form and mark your ballot paper
ga: Ní mór duit an fhoirm a chomhlíonadh agus an páipéar ballóide a mharcáil

source: You must then send both papers back to the returning officer for the university
ga: Ní mór duit ansin an dá pháipéar a chur ar ais chuig oifig an cheann chomhairimh san Ollscoil
